In [1]:
## Importing Library
import pandas as pd

In [2]:
## Loading the dataset
df=pd.read_csv("Analyst_test.csv")
df.head()

                                           Address  customer_id
0    7 Sterling Circuit, Camperdown NSW, Australia            1
1                17 HODDLE ST, PADDINGTON NSW 7071            2
2  1310/3 Kingsborough Way, Zetland NSW, Australia            3
3     94 Coventry Street, Southbank VIC, Australia            4
4             53 PARRAMATTA RD, ANNANDALE NSW 7033            5

In [3]:
## Getting the shape 
df.shape

(972, 2)

In [4]:
df['Street']=df['Address'].str.split(',').str[0] ## Getting the street Number
df['city']=df['Address'].str.split(',').str[1] ## Getting the City and State Name
df['Country']=df['Address'].str.split(',').str[2] ## GEtting the Country Name

In [5]:
df.head()

,Address,customer_id,Street,city,Country
0,"7 Sterling Circuit, Camperdown NSW, Australia",1,7 Sterling Circuit,Camperdown NSW,Australia
1,"17 HODDLE ST, PADDINGTON NSW 7071",2,17 HODDLE ST,PADDINGTON NSW 7071,NaN
2,"1310/3 Kingsborough Way, Zetland NSW, Australia",3,1310/3 Kingsborough Way,Zetland NSW,Australia
3,"94 Coventry Street, Southbank VIC, Australia",4,94 Coventry Street,Southbank VIC,Australia
4,"53 PARRAMATTA RD, ANNANDALE NSW 7033",5,53 PARRAMATTA RD,ANNANDALE NSW 7033,NaN

In [6]:
df['State']=df['city'].str.split(' ').str[2]  ## Getting the State Name
df['City']=df['city'].str.split(' ').str[1]   ## Getting the City Name
df['Postcode']=df['city'].str.split(' ').str[3]

In [7]:
df.head()

,Address,customer_id,Street,city,Country,State,City,Postcode
0,"7 Sterling Circuit, Camperdown NSW, Australia",1,7 Sterling Circuit,Camperdown NSW,Australia,NSW,Camperdown,NaN
1,"17 HODDLE ST, PADDINGTON NSW 7071",2,17 HODDLE ST,PADDINGTON NSW 7071,NaN,NSW,PADDINGTON,7071
2,"1310/3 Kingsborough Way, Zetland NSW, Australia",3,1310/3 Kingsborough Way,Zetland NSW,Australia,NSW,Zetland,NaN
3,"94 Coventry Street, Southbank VIC, Australia",4,94 Coventry Street,Southbank VIC,Australia,VIC,Southbank,NaN
4,"53 PARRAMATTA RD, ANNANDALE NSW 7033",5,53 PARRAMATTA RD,ANNANDALE NSW 7033,NaN,NSW,ANNANDALE,7033

In [8]:
df.isnull().sum()

Address          0
customer_id      0
Street           0
city             0
Country        328
State            6
City             0
Postcode       431
dtype: int64

In [9]:
## Dropping the unnecessary columns

col=["city",'Address']
df.drop(col,axis=1,inplace=True)

In [10]:
df.head()

   customer_id                   Street     Country State        City Postcode
0            1       7 Sterling Circuit   Australia   NSW  Camperdown      NaN
1            2             17 HODDLE ST         NaN   NSW  PADDINGTON     7071
2            3  1310/3 Kingsborough Way   Australia   NSW     Zetland      NaN
3            4       94 Coventry Street   Australia   VIC   Southbank      NaN
4            5         53 PARRAMATTA RD         NaN   NSW   ANNANDALE     7033

In [11]:
df.to_csv('Solution_1')